"""
组织3组  tpshop 登录的数据
每一组数据包含 用户名，密码和验证码
字符串，列表，元组，字典
name="itcast"
age=20
“itcast&20&北京”
     ( (),(),() )
列表  [  [用户名，密码，验证码],[用户名，密码，验证码],[用户名，密码，验证码] ]

字典  [  {},{},{}  ]
[ {“name”:"用户名","pwd":"密码","code":"验证码"},
      {“name”:"用户名","pwd":"密码","code":"验证码"},
      {“name”:"用户名","pwd":"密码","code":"验证码"}  ]
字典的key不能出现重复
"""
# 数据 列表 嵌套 列表
data_list = [
    ["13800000001","123456","8888"],
    ["1380000000","123456","8888"],
    ["13800000001","123456a","8888"]
]

# 数据 字典 [  {},{},{}  ]
# 一个大括号【一个字典里】key不能重复
data_dict = [
    {"name":"13800000001","pwd":"123456","code":"8888"},
    {"name":"1380000000","pwd":"123456","code":"8888"},
    {"name":"13800000001","pwd":"123456a","code":"8888"}
]